Revit 2027 API
ButtonData.Image Property
The image of the button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImageSource Image { get; set; }
Public Property Image As ImageSource
	Get
	Set
public:
property ImageSource^ Image {
	ImageSource^ get ();
	void set (ImageSource^ value);
}
member Image : ImageSource with get, set
Property Value
ImageSource
Remarks
The image will be shown on the button if it is a part of a stacked set, or if it is promoted to the Quick Access Toolbar. The best size is 16 x 16 pixels; if larger, the image will NOT be adjusted to fit the toolbar button.
See Also
Reference
ButtonData Class
Autodesk.Revit.UI Namespace